Tekla.Structures.Drawing.PrintHandler.PrintDrawingOperation(Tekla.Structures.Drawing.DrawingHandler,System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.Drawing},System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.DPMPrinterAttributes},System.Collections.Generic.IEnumerable{System.String})
The print drawing operation using the DPMPrinterAttributes and
corresponding external printing functionality. If the given drawing
is not the active drawing, it will set it to be active but hidden,
and will then close it.
drawingHandler: The drawing handler.
drawings: The drawings.
printerAttributesList: The printer attributes list.
fileNames: Optional output file names for PDF printing. Overrides attributes output file name.
Throws System.ArgumentNullException: Throws if any arguments are null.
Throws System.ArgumentException: Throws if drawings, printerAttributesList and fileNames are not equal length.
Throws System.ArgumentException: Throws if drawings or printerAttributesList contain null values.
Returns: A list of the result of each drawing, true if successful.

Tekla.Structures.Drawing.PrintHandler.GetScaleFactor(Tekla.Structures.Drawing.DotPrintScalingType,System.Double)
Creates a string based on the given input enum.
scalingMethod: The outputType enum.
scaleFactor: The scale factor.